-- ==========================================
-- SQL01: 连续登录天数
-- ==========================================
DROP TABLE IF EXISTS t1_login_log;
CREATE TABLE t1_login_log (
    user_id    VARCHAR(64),
    login_date DATE
);
COMMENT ON TABLE t1_login_log IS '用户登录日志表';
COMMENT ON COLUMN t1_login_log.user_id IS '用户ID';
COMMENT ON COLUMN t1_login_log.login_date IS '登录日期';

INSERT INTO t1_login_log VALUES
('u01', '2026-07-01'),
('u01', '2026-07-02'),
('u01', '2026-07-03'),
('u01', '2026-07-05'),
('u01', '2026-07-06'),
('u02', '2026-07-01'),
('u02', '2026-07-02'),
('u02', '2026-07-04'),
('u03', '2026-07-01'),
('u03', '2026-07-02'),
('u03', '2026-07-03'),
('u03', '2026-07-04'),
('u03', '2026-07-05'),
('u03', '2026-07-06'),
('u04', '2026-07-01'),
('u04', '2026-07-03'),
('u04', '2026-07-05');
